app/controllers/charges_controller.rb

SELECT "promotions".* FROM "promotions" WHERE "promotions"."venue_id" = ?  [["venue_id", 4]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."promotion_id" = ?  [["promotion_id", 10]]
---
	def index
		if current_user
			@transactions = current_user.transactions.all
		elsif current_venue
			@promotions = current_venue.promotions.all
			@transactions = current_venue.transactions.all

UPDATE "transactions" SET "active" = $1, "updated_at" = $2 WHERE "transactions"."id" = $3  [["active", "f"], ["updated_at", "2017-09-05 20:17:27.297224"], ["id", 14]]
---
	def toggle_active
		@transaction.update_attribute(:active, false)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "stripe_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["stripe_id", "cus_BKiN2b4YKSfeLA"], ["updated_at", "2017-09-03 18:36:16.098296"], ["id", 5]]
---
	def create

		charge_description = "#{@promotion.venue.name} - #{@promotion.name} - #{@promotion.day_of_week}"
		if current_user.stripe_id.present?
			charge = ChargeService.create_charge(current_user.stripe_id, @promotion.price*100, charge_description)
		else
			customer = ChargeService.create_customer(params)
			@user = User.find(current_user.id)
			@user.stripe_id = customer.id
			current_user.stripe_id = customer.id
			@user.save

SELECT  "promotions".* FROM "promotions" WHERE "promotions"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
		def set_promotion_charge
			@promotion = Promotion.find(params[:promotion_id])